tool-artifacts/artillery/artillery.yml
config:
  target: "http://17313-team02.s3d.cmu.edu:4567"
  phases:
    - duration: 30
      arrivalRate: 2
  defaults:
    headers:
      User-Agent: "CMU-313-artillery-test"

scenarios:
  - name: "Basic browsing (no auth)"
    flow:
      - get:
          url: "/"
      - get:
          url: "/categories"
      - get:
          url: "/recent"