tool-artifacts/artillery/artillery.yml
# Canonical Artillery load-test config (e.g. run against deployed server).
# For CI, the workflow uses artillery.ci.yml which targets the local server.
config:
  target: "http://17313-team02.s3d.cmu.edu:4567"
  phases:
    - duration: 30
      arrivalRate: 2
  defaults:
    headers:
      User-Agent: "CMU-313-artillery-test"

scenarios:
  - name: "Basic browsing (no auth)"
    flow:
      - get:
          url: "/"
      - get:
          url: "/categories"
      - get:
          url: "/recent"