tool-artifacts/artillery/output.txt
Test run id: t8jyb_kxejq684n5az48ktgbknqj5kjadj7_e7x9
Phase started: unnamed (index: 0, duration: 30s) 15:48:05(+0000)

--------------------------------------
Metrics for period to: 15:48:10(+0000) (width: 3.115s)
--------------------------------------

http.codes.200: ................................................................ 24
http.downloaded_bytes: ......................................................... 1233560
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 24
http.response_time:
  min: ......................................................................... 8
  max: ......................................................................... 102
  mean: ........................................................................ 22.6
  median: ...................................................................... 10.1
  p95: ......................................................................... 92.8
  p99: ......................................................................... 98.5
http.response_time.2xx:
  min: ......................................................................... 8
  max: ......................................................................... 102
  mean: ........................................................................ 22.6
  median: ...................................................................... 10.1
  p95: ......................................................................... 92.8
  p99: ......................................................................... 98.5
http.responses: ................................................................ 24
vusers.completed: .............................................................. 8
vusers.created: ................................................................ 8
vusers.created_by_name.Basic browsing (no auth): ............................... 8
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 55.2
  max: ......................................................................... 325.4
  mean: ........................................................................ 185.7
  median: ...................................................................... 175.9
  p95: ......................................................................... 273.2
  p99: ......................................................................... 273.2


--------------------------------------
Metrics for period to: 15:48:20(+0000) (width: 9.109s)
--------------------------------------

http.codes.200: ................................................................ 60
http.downloaded_bytes: ......................................................... 3083900
http.request_rate: ............................................................. 6/sec
http.requests: ................................................................. 60
http.response_time:
  min: ......................................................................... 6
  max: ......................................................................... 99
  mean: ........................................................................ 12.6
  median: ...................................................................... 8.9
  p95: ......................................................................... 23.8
  p99: ......................................................................... 96.6
http.response_time.2xx:
  min: ......................................................................... 6
  max: ......................................................................... 99
  mean: ........................................................................ 12.6
  median: ...................................................................... 8.9
  p95: ......................................................................... 23.8
  p99: ......................................................................... 96.6
http.responses: ................................................................ 60
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Basic browsing (no auth): ............................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 48.7
  max: ......................................................................... 162.6
  mean: ........................................................................ 79.5
  median: ...................................................................... 59.7
  p95: ......................................................................... 141.2
  p99: ......................................................................... 141.2


--------------------------------------
Metrics for period to: 15:48:30(+0000) (width: 9.262s)
--------------------------------------

http.codes.200: ................................................................ 60
http.downloaded_bytes: ......................................................... 3083900
http.request_rate: ............................................................. 6/sec
http.requests: ................................................................. 60
http.response_time:
  min: ......................................................................... 7
  max: ......................................................................... 97
  mean: ........................................................................ 13.6
  median: ...................................................................... 10.1
  p95: ......................................................................... 21.1
  p99: ......................................................................... 94.6
http.response_time.2xx:
  min: ......................................................................... 7
  max: ......................................................................... 97
  mean: ........................................................................ 13.6
  median: ...................................................................... 10.1
  p95: ......................................................................... 21.1
  p99: ......................................................................... 94.6
http.responses: ................................................................ 60
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Basic browsing (no auth): ............................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 56.1
  max: ......................................................................... 225.7
  mean: ........................................................................ 111.4
  median: ...................................................................... 80.6
  p95: ......................................................................... 210.6
  p99: ......................................................................... 210.6


Phase completed: unnamed (index: 0, duration: 30s) 15:48:35(+0000)

--------------------------------------
Metrics for period to: 15:48:40(+0000) (width: 5.108s)
--------------------------------------

http.codes.200: ................................................................ 36
http.downloaded_bytes: ......................................................... 1850340
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 36
http.response_time:
  min: ......................................................................... 7
  max: ......................................................................... 98
  mean: ........................................................................ 11.3
  median: ...................................................................... 7.9
  p95: ......................................................................... 16.9
  p99: ......................................................................... 22.9
http.response_time.2xx:
  min: ......................................................................... 7
  max: ......................................................................... 98
  mean: ........................................................................ 11.3
  median: ...................................................................... 7.9
  p95: ......................................................................... 16.9
  p99: ......................................................................... 22.9
http.responses: ................................................................ 36
vusers.completed: .............................................................. 12
vusers.created: ................................................................ 12
vusers.created_by_name.Basic browsing (no auth): ............................... 12
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 49.6
  max: ......................................................................... 154.1
  mean: ........................................................................ 66.1
  median: ...................................................................... 56.3
  p95: ......................................................................... 79.1
  p99: ......................................................................... 79.1


All VUs finished. Total time: 30 seconds

--------------------------------
Summary report @ 15:48:37(+0000)
--------------------------------

http.codes.200: ................................................................ 180
http.downloaded_bytes: ......................................................... 9251700
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 180
http.response_time:
  min: ......................................................................... 6
  max: ......................................................................... 102
  mean: ........................................................................ 14
  median: ...................................................................... 8.9
  p95: ......................................................................... 24.8
  p99: ......................................................................... 98.5
http.response_time.2xx:
  min: ......................................................................... 6
  max: ......................................................................... 102
  mean: ........................................................................ 14
  median: ...................................................................... 8.9
  p95: ......................................................................... 24.8
  p99: ......................................................................... 98.5
http.responses: ................................................................ 180
vusers.completed: .............................................................. 60
vusers.created: ................................................................ 60
vusers.created_by_name.Basic browsing (no auth): ............................... 60
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 48.7
  max: ......................................................................... 325.4
  mean: ........................................................................ 101.6
  median: ...................................................................... 66
  p95: ......................................................................... 223.7
  p99: ......................................................................... 273.2